{
    "01": "The application creates and signs an authorization request, sends it to Hellō, and redirects the user to Hellō.",
    "02": "The Orchestration Service requests the Token Service create a new Session Token from the Request Token.",
    "03": "The Token Service generates a new session id (sid) and mints a new Session Token with the iss and nonce claims from the Request Token, and returns it to the Orchestration Service.",

    "10": "Hellō redirects the user to their preferred OpenID Provider (OP), the OP authenticates the user, and redirects the user back to Hellō with an ID Token signed by the OP.",
    "11": "The Orchestration Service requests a Subject Record with the iss=op.example and sub=OP-123456. The record is not found.",
    "12": "The Orchestration Service requests the Token Service to create a Subject Record and ID Token.",
    "13": "The Token Service verifies the passed tokens, generates a new user identifier and mints a Subject Record and ID Token with claims taken from the tokens passed in.",
    "14": "The Orchestration Service verifies the identifiers all match as indicated.",
    "15": "The Orchestration Service saves the Subject Record in the database.",
    "16": "The Orchestration Service retrieves the Subject Record with the iss=op.example and sub=OP-123456.",
    "17": "The Orchestration Service requests the Token Service to create an ID Token based on the passed tokens and records.",
    "18": "The Token Service verifies the passed Subject Record, the tokens, and that the identifiers all match as indicated.",
    "19": "The Token Service generates an ID Token with claims taken from the Subject Record and the Request Token.",
    "20": "The Orchestration Service verifies the identifiers all match as indicated.",
    "21": "The Orchestration Service verifies the ID Token, and then requests an Access Token to read a corresponding Subject Record.",
    "22": "The Token Service verifies the ID Token creates an Access Token to read the Subject Record identified by the iss and sub in the ID Token.",
    "23": "The Orchestration Service verifies the identifiers all match as indicated.",
    "24": "The Orchestration Service presents the Access Token to the Storage Service.",
    "25": "The Storage Service verifies the Access Token, tries to read from the database, and discovers the Subject Record does not exist.",
    "26": "The Storage Service generates an Error Token based on the Access Token.",
    "27": "The Orchestration Service verifies the identifiers all match as indicated.",
    "28": "The Orchestration Service requests the Token Service create a Subject Record and ID Token.",
    "29": "The Token Service verifies the passed tokens and that the identifiers match as indicated.",
    "30": "The Token Service generates a random identifier for the new user, and mints a Subject Record, an Access Token, and an ID Token, and returns them to the Orchestration Service.",
    "31": "The Orchestration Service verifies the identifiers all match as indicated.",
    "32": "The Orchestration Service presents the Access Token and the Subject Record to the Storage Service.",
    "33": "The Storage Service verifies the Access Token and stores the Subject Record in the database.",
    "34": "The Storage Service verifies the Access Token and retrieves the Subject Record.",
    "35": "The Storage Service returns the Subject Record to the Orchestration Service.",
    "36": "The Orchestration Service verifies the identifiers all match as indicated.",
    "37": "The Orchestration Service requests the Token Service to create an ID Token.",
    "38": "The Token Service verifies the passed tokens, the Subject Record, and that the identifiers match as indicated.",
    "39": "The Token Service generates an ID Token with claims taken from the Subject Record, the ID Token, and the Request Token.",
    "40": "The Orchestration Service verifies the identifiers all match as indicated.",
    "41": "The Token Service generates a new user identifier and mints an ID Token, a Subject Record, a Release Token, and associated Access Tokens with claims taken from the tokens passed in.",
    "42": "The Orchestration Service verifies the identifiers all match as indicated.",
    "43": "The Orchestration Service presents the records and Access Tokens to the Storage Service.",
    "44": "The Storage Service verifies the Access Tokens and stores the Records in the database.",
    "45": "The Orchestration Service requests an Access Token for the Release Record from the Token Service.",
    "46": "The Token Service verifies the ID Token, the Subject Record, and that the identifiers match as indicated.",
    "47": "The Token Service mints an Access Token to read the Release Record identified by the Subject Record.",
    "48": "The Orchestration Service verifies the identifiers all match as indicated.",
    "49": "The Orchestration Service presents the Access Token to the Storage Service.",
    "50": "The Storage Service verifies the Access Token and retrieves the Release Record.",
    "51": "The Storage Service returns the Release Record to the Orchestration Service.",
    "52": "The Orchestration Service verifies the identifiers all match as indicated.",
    "53": "The Orchestration Service requests the Token Service to create an ID Token based on the passed tokens and records.",
    "54": "The Token Service verifies the passed tokens, records, and that the identifiers match as indicated.",
    "55": "The Token Service generates an ID Token with claims taken from the Subject Record, the ID Token, the Release Record, and the Request Token.",
    "56": "The Orchestration Service verifies the identifiers all match as indicated.",
    "57": "The Token Service generates a hash from the Subject Record iss and sub claims and and generates an Access Token with the hash.",
    "58": "The Orchestration Service computes the hash of the Subject Record iss and sub claims and verifies it matches the Access Token hash.",
    "59": "The Orchestration Service presents the Subject Record and Access Token to the Encryption Service.",
    "60": "The Encryption Service encrypts the Subject Record to create the Encrypted Record and then presents the Encrypted Record and Access Token to the Storage Service.",
    "61": "The Storage Service verifies the Access Token and stores the Encrypted Record.",
    "62": "-",
    "63": "The Orchestration Service presents the Access Token to the Encryption Service.",
    "64": "The Encryption Service presents the Access Token to the Storage Service.",
    "65": "The Storage Service verifies the Access Token and retrieves the Encrypted Record.",
    "66": "The Storage Service returns the Encrypted Record to the Encryption Service.",
    "67": "The Encryption Service decrypts the Encrypted Record and returns the Subject Record to the Orchestration Service.",
    "68": "The Orchestration Service computes the hash of the iss and sub claims and verifies it matches the Access Token hash.",
    "69": "-",
    "70": "The Orchestration Service requests an Access Token for a Subject Record from the Token Service.",
    "71": "The Token Service verifies the passed tokens, and that the identifiers match as indicated.",
    "72": "The Token Service updates the Session Token with the ID Token iss and sub claims, creates a hash from the iss and sub, and mints an Access Token with the hash.",
    "73": "The Orchestration Service verifies the iss and sub in the Session Token and ID Token match, then computes the hash of the iss and sub claims and verifies it matches the Access Token hash.",
    "74": "The Orchestration Service verifies the identifiers match as indicated.",
    "75": "The Orchestration Service requests an Access Token for a Release Record from the Token Service.",
    "76": "The Token Service verifies the Session Token, the Subject Record, and that the identifiers match as indicated.",
    "77": "The Token Service updates the Session Token with the user id in the Subject Record, creates a hash from the user id, and mints an Access Token with the hash.",
    "78": "The Orchestration Service computes the hash of the user id and verifies it matches the Access Token hash.",

    "83": "The Orchestration Service presents the Access Token to the Encryption Service.",
    "84": "The Encryption Service presents the Access Token to the Storage Service.",
    "85": "The Storage Service verifies the Access Token and retrieves the Encrypted Record.",
    "86": "The Storage Service returns the Encrypted Record to the Encryption Service.",
    "87": "The Encryption Service decrypts the Encrypted Record and returns the Release Record to the Orchestration Service.",

    "90": "The Orchestration Service verifies the identifiers match as indicated.",
    "91": "The Orchestration Service requests the Token Service to create an ID Token",
    "92": "The Token Service verifies the Session Token, the Release Record, and that the identifiers match as indicated.",
    "93": "The Token Service generates an ID Token with claims taken from the Session Token and the Release Record.",
    "94": "The Orchestration Service verifies the identifiers match as indicated.",

    "99": "Hellō redirects the user back to the application with the Hellō ID Token."
}
